import React from "react";
import "./teams.css";
import sampleImage from "../../images/mock-image-1.jpeg";

const TeamsData = [
    {
        id: 1,
        title: "வலையமைப்பு அணி",
        description: `
        பன்முக தொழில்நுட்ப கோர்வைகளை ஒருங்கிணைத்து தேசம் கடந்தும் நம் மொறட்டுவை தாயவழின் புகழ் தனை பறைசாற்ற இணையவழி முரசாக முழங்குவதே பிரதான நோக்கமாகும். எமது உத்தியோகபூர்வ வலைத்தளத்தின் ஊடாக எமது கடந்த கால நிகழ்வுகள் மற்றும் படைப்புகள் மட்டுமன்றி வருடாவருடம் தமிழருவி நிகழ்வில் வெளியிடப்படும் பல நினைவலைகளை தாங்கி வரும் இதழ்களையும் நிகழ்நிலையில் காலத்தால் அழியாத வகையில் ஆவணப்படுத்தலும் அறிக்கையிடுதலுமே தலையாய நோக்கம் ஆகும்`,
        image_1: `${sampleImage}`,
        image_1_alt: "Sample",
        image_2: `${sampleImage}`,
        image_2_alt: "Sample",
    },
    {
        id: 2,
        title: "ஊடக அணி",
        description: "அனைத்து அணிகளின் அயராத உழைப்புக்கும் அழகியல் வடிவம் கொடுப்பவர்கள் இவர்கள்.  பல்லாயிரக்கணக்கான புகைப்படங்களை படம்பிடித்து அழகுக்கு மேலும் அழகு சேர்க்கும் வகையில் வர்ணனைகள் தீட்டியும், பதாகைகள், நிகழ்ச்சி குறும் காணொளிகள் என வடிவமைப்புகளையும் மேற்கொண்டு சமூக வலைத்தளங்களை தம் கை பிடிக்குள் கவர்ந்து வைப்பதே இவர்களின் பிரதான நோக்கமாகும்",
        image_1: `${sampleImage}`,
        image_1_alt: "Sample",
        image_2: `${sampleImage}`,
        image_2_alt: "Sample",
    },
    {
        id: 3,
        title: "வடிவமைப்பு அணி",
        description: "கலை எனும் கருவிற்கு தொழில் நுட்பம் எனும் உயிர் செலுத்தப்பட்டு புதிய சிந்தனைகளில் அறிவியல் சார் வடிவமைப்புகள் மேடை அலங்காரம் என நிகழ்விற்கான கண்கவர் சிந்தனாவோவியங்களை கண்முன் வடிவமைப்பதே முக்கிய பங்காகும். எமது கடந்த கால நிகழ்வுகளில் ஒரு புதுமைகளை புதிய படைப்பாற்றலை பறைசாற்றும் முகமாக ஒரு பக்கம் காதல் இன்னொரு பக்கம் வீரம் என சங்க இலக்கியங்களின் ஐந்நில விழுமியப் பண்புகளை ஒருங்கே முப்பரிமாண தோற்றத்தில் மேடை அலங்கரிப்பு என்பவை குறிப்பிடத்தக்க பதிவுகளாகும்",
        image_1: `${sampleImage}`,
        image_1_alt: "Sample",
        image_2: `${sampleImage}`,
        image_2_alt: "Sample",
    },
    {
        id: 4,
        title: "தொழில்நுட்ப அணி",
        description: "மொறட்டுவை பல்கலைக்கழகம் ஒரு தொழில்நுட்ப பல்கலைகழகம் என்பதை பறைசாற்றும் முகமாக எமது தமிழ் இலக்கிய மன்றத்தால் ஏற்பாடு செய்யப்படும் நிகழ்வுகளில் வழமையான செயல்பாடுகளை தொழில்நுட்ப மிகுதியுடன் கலாச்சாரம் மிகு‌ந்த புதிய படைப்புகளாக மாற்றுவதே பிரதான நோக்கமாகும். எமது கடந்த கால பதிவுகளில் ஒரு புதிய படைப்பாக தன்னியக்க முறையில் நூல் வெளியீடு, கண்கவர் ஒளி வடிவமைப்புகள், தொடுதிரை மூலமாக மங்களவிளக்கேற்றல் என்பவற்றை குறிப்பிடலாம்",
        image_1: `${sampleImage}`,
        image_1_alt: "Sample",
        image_2: `${sampleImage}`,
        image_2_alt: "Sample",
    },
];

const Teams = () => {
    return (
        <div className="teams">
            <h1>அணிகள்</h1>
            <p className="intro">
            தமிழ் இலக்கிய மன்றத்தினால் வருடந்தோறும் தமக்கேயான தனியான பாணியில் தமிழருவி, சொற்கணை, பொங்கல் விழா, வாணி விழா, ஜீவநதி, துடுப்பாட்ட சுற்றுப்போட்டிகள் என எமது பல்கலைக்கழக மாணவர்கள் மட்டுமன்றி ஏனைய பல்கலைக்கழக மாணவர்கள், பாடசாலை மாணவர்கள் மட்டுமன்றி உலகெங்கும் பரந்து வாழும் தமிழ் மக்களின் திறன் விருத்திக்கும் ஆளுமை வளர்ச்சிக்கும் ஏற்பாடு செய்யப்பட்டு வருகின்றது. இந்த அனைத்து நிகழ்வுகளிற்கான ஏற்பாடுகள் ஆரம்பம் முதல் இறுதி வரை செவ்வனே புதிய படைப்புகளாகவும் தொழில்நுட்ப வளர்ச்சியின் அத்தியாயமாகவும் அமைய வடிவமைக்க வழிகோலும் வகையில் முதுகென்பாக இருக்கின்றார்கள் நம் வலையமைப்பு அணி, ஊடக அணி, வடிவமைப்பு அணி, தொழில்நுட்ப அணி.
            </p>
            {TeamsData.map((teamsData) => {
                return (
                    <div key={teamsData.id} className="teams-card">
                        <p className="teams-card-title">{teamsData.title}</p>
                        <p className="teams-card-description">{teamsData.description}</p>
                        {/* <img
                            src={teamsData.image_1}
                            alt={teamsData.image_1_alt}
                        />
                        <img
                            src={teamsData.image_2}
                            alt={teamsData.image_2_alt}
                        /> */}
                    </div>
                );
            })}
        </div>
    );
};

export default Teams;
