const events = [
    {
        title: 'தைப்பொங்கல் ',
        active: true,
        link: '/events/thaipongal',
        date: '08/01/2023',
        descriiption: 'தைமாதம் பல்கலைகழக வளாகத்தினுள் பாரம்பரியத்தை பறைசாற்றும் வகையில் பாரம்பரிய தமிழர் விளையாட்டுக்களுடன் விழாக்கோலம் கானும்'
    },
    {
        title: 'சொற்கணை',
        active: false,
        link: '/events/comingSoon',
        date: 'TBD',
        descriiption: 'மாபெரும் விவாதச்சமர்.'
    },
    {
        title: 'தமிழருவி',
        active: false,
        link: '/events/comingSoon',
        date: 'TBD',
        descriiption: 'பிரம்மாண்டத்தின் உச்சமாக நடைபெறும் கலை நிகழ்வு "தமிழருவி" ஆகும்'
    },
    {
        title: 'ஒளிச்சுவடு',
        active: false,
        link: '/events/comingSoon',
        date: 'TBD',
        descriiption: 'கலைதுறையில் ஆர்வம் காட்டத்துடிக்கும் மாணவர்களின் அருமையை வெளிக்கொணரும் ஒளிப்பட போட்டியே "ஒளிச்சுவடு" ஆகும்'
    },
    {
        title: 'இரத்ததான முகாம் ',
        active: false,
        link: '/events/comingSoon',
        date: 'TBD',
        descriiption: 'எமது சொந்தங்களை உதவிக்கரம் கொடுத்து உயிரை காப்பாற்றும் வகையில் மேற்கொள்ளப்பட்டு வருகின்றது.'
    },
    {
        title: 'ஜீவநதி',
        active: false,
        link: '/events/comingSoon',
        date: 'TBD',
        descriiption: 'இது மொறட்டுவைப் பல்கலைக்கழக தமிழ் இலக்கிய மன்றத்தின் ஜீவ காருண்யப் பயணம்.'
    },
    //  {
    //     title: 'சொற்கணை',
    //     img: img,
    //     descriiption: '’’சொற்கணை’’ என்பது மாபெரும் விவாதச்சமர். இலங்கையின் 25 மாவட்டங்களில் தேர்வு செய்யப்பட்ட சிறந்த விவாத அணிகள் சொல் எனும் கணை கொண்டு களமாடும் இறுதிகட்ட விவாத சமர் தலை நகரில் பிரதான மண்டபத்தில் பல்லாயிரக்கணக்கானோர் முன்னிலையில் மிகவும் கோலாகலமாக நடைபெறுவதாகும்.'
    // },
    // {
    //     title: 'தமிழருவி',
    //     img: img2,
    //     descriiption: 'தமிழ் சமூகத்தின் மிகப்பெரிய பேறுகளான கலை கல்வி மற்றும் கலாச்சாரம் ஆகியவற்றின் இன்றைய விருத்திக்கும் நாளைய இருப்பிற்கும் தூணாய் நிற்க முனையும் எம் மொறட்டுவை பல்கலைகழக தமிழ் மன்றம் வருடந்தோறும் தலைநகரில் இலட்சக்கணக்கானோர் முன்னிலையில் பிரம்மாண்டத்தின் உச்சமாக நடைபெறும் கலை நிகழ்வு "தமிழருவி" ஆகும்'
    // },
]

export default events